danielbalster/a500kbd-usbhid-stm32/Src/main.c
// page 362 of Amiga Hardware Reference Manual

const uint8_t amiga_to_hid[128] = {
  HIDKEY_TILDE,                                  // 00
  HIDKEY_1,                                      // 01
  HIDKEY_2,                                      // 02
  HIDKEY_3,                                      // 03
  HIDKEY_4,                                      // 04
  HIDKEY_5,                                      // 05
  HIDKEY_6,                                      // 06
  HIDKEY_7,                                      // 07
  HIDKEY_8,                                      // 08
  HIDKEY_9,                                      // 09
  HIDKEY_0,                                      // 0A
  HIDKEY_UNDERSCORE,                             // 0B
  HIDKEY_PLUS,                                   // 0C
  HIDKEY_BACKSLASH,                              // 0D
  0,                                             // 0E not connected
  HIDKEY_KP_0,                                   // 0F

  HIDKEY_Q,                                      // 10
  HIDKEY_W,                                      // 11
  HIDKEY_E,                                      // 12
  HIDKEY_R,                                      // 13
  HIDKEY_T,                                      // 14
  HIDKEY_Y,                                      // 15
  HIDKEY_U,                                      // 16
  HIDKEY_I,                                      // 17
  HIDKEY_O,                                      // 18
  HIDKEY_P,                                      // 19
  HIDKEY_OPEN_BRACKET,                           // 1A
  HIDKEY_CLOSE_BRACKET,                          // 1B
  0,                                             // 1C not connected
  HIDKEY_KP_1,                                   // 1D
  HIDKEY_KP_2,                                   // 1E
  HIDKEY_KP_3,                                   // 1F
                                                  
  HIDKEY_A,                                      // 20
  HIDKEY_S,                                      // 21
  HIDKEY_D,                                      // 22
  HIDKEY_F,                                      // 23
  HIDKEY_G,                                      // 24
  HIDKEY_H,                                      // 25
  HIDKEY_J,                                      // 26
  HIDKEY_K,                                      // 27
  HIDKEY_L,                                      // 28
  HIDKEY_COLON,                                  // 29
  HIDKEY_QUOTE,                                  // 2A
  HIDKEY_HASH,                                   // 2B
  0,                                             // 2C not connected
  HIDKEY_KP_4,                                   // 2D
  HIDKEY_KP_5,                                   // 2E
  HIDKEY_KP_6,                                   // 2F

  HIDKEY_NON_US_BACKSLASH_AND_SLASH,             // 30
  HIDKEY_Z,                                      // 31
  HIDKEY_X,                                      // 32
  HIDKEY_C,                                      // 33
  HIDKEY_V,                                      // 34
  HIDKEY_B,                                      // 35
  HIDKEY_N,                                      // 36
  HIDKEY_M,                                      // 37
  HIDKEY_COMMA,                                  // 38
  HIDKEY_DOT,                                    // 39
  HIDKEY_SLASH,                                  // 3A
  0,                                             // 3B // not connected
  HIDKEY_KP_DOT_AND_DELETE,                      // 3C
  HIDKEY_KP_7,                                   // 3D
  HIDKEY_KP_8,                                   // 3E
  HIDKEY_KP_9,                                   // 3F
                                                  
  HIDKEY_SPACEBAR,                               // 40
  HIDKEY_BACKSPACE,                              // 41
  HIDKEY_TAB,                                    // 42
  HIDKEY_KP_ENTER,                               // 43
  HIDKEY_ENTER,                                  // 44
  HIDKEY_ESCAPE,                                 // 45
  HIDKEY_DELETE,                                 // 46
  0,                                             // 47
  0,                                             // 48
  0,                                             // 49
  HIDKEY_KP_MINUS,                               // 4A
  0,                                             // 4B
  HIDKEY_UP,                                     // 4C
  HIDKEY_DOWN,                                   // 4D
  HIDKEY_RIGHT,                                  // 4E
  HIDKEY_LEFT,                                   // 4F
                                                  
  HIDKEY_F1,                                     // 50
  HIDKEY_F2,                                     // 51
  HIDKEY_F3,                                     // 52
  HIDKEY_F4,                                     // 53
  HIDKEY_F5,                                     // 54
  HIDKEY_F6,                                     // 55
  HIDKEY_F7,                                     // 56
  HIDKEY_F8,                                     // 57
  HIDKEY_F9,                                     // 58
  HIDKEY_F10,                                    // 59
  HIDKEY_KP_NUM_LOCK,                            // 5A Numeric pad left (
  HIDKEY_SCROLL_LOCK,                            // 5B Numeric pad right )
  HIDKEY_KP_DIVIDE,                              // 5C
  HIDKEY_KP_MULTIPLY,                            // 5D
  HIDKEY_KP_PLUS,                                // 5E
  HIDKEY_HELP,                                   // 5F help

  HIDKEY_MODIFIER_LEFT_SHIFT,                    // 60 Left Shift
  HIDKEY_MODIFIER_RIGHT_SHIFT,                   // 61 Right Shift
  HIDKEY_CAPS_LOCK,                              // 62 Caps Lock
  HIDKEY_MODIFIER_LEFT_CTRL,                     // 63 Control
  HIDKEY_MODIFIER_LEFT_ALT,                      // 64 Left Alt
  HIDKEY_MODIFIER_RIGHT_ALT,                     // 65 Right Alt
  HIDKEY_MODIFIER_LEFT_UI,                       // 66 Left Amiga
  HIDKEY_MODIFIER_RIGHT_UI,                      // 67 Right Amiga
  0,                                             // 68
  0,                                             // 69
  0,                                             // 6A
  0,                                             // 6B
  0,                                             // 6C
  0,                                             // 6D
  0,                                             // 6E
  0,                                             // 6F
                                                  
  0,                                             // 70
  0,                                             // 71
  0,                                             // 72
  0,                                             // 73
  0,                                             // 74
  0,                                             // 75
  0,                                             // 76
  0,                                             // 77
  0,                                             // 78
  0,                                             // 79
  0,                                             // 7A
  0,                                             // 7B
  0,                                             // 7C
  0,                                             // 7D
  0,                                             // 7E
  0,                                             // 7F
};
const uint8_t ascii2hid[128] = {
  0, // 00
  0, // 01
  0, // 02
  0, // 03
  0, // 04
  0, // 05
  0, // 06
  0, // 07
  0, // 08
  0, // 09
  0, // 0A
  0, // 0B
  0, // 0C
  0, // 0D
  0, // 0E
  0, // 0F
  
  0, // 10
  0, // 11
  0, // 12
  0, // 13
  0, // 14
  0, // 15
  0, // 16
  0, // 17
  0, // 18
  0, // 19
  0, // 1A
  0, // 1B
  0, // 1C
  0, // 1D
  0, // 1E
  0, // 1F

  HIDKEY_SPACEBAR, // 20 space
  0, // 21 !
  0, // 22 "
  0, // 23 #
  0, // 24 $
  0, // 25 %
  0, // 26 &
  0, // 27 '
  0, // 28 (
  0, // 29 )
  0, // 2A *
  0, // 2B +
  0, // 2C ,
  0, // 2D -
  0, // 2E .
  0, // 2F /

