danielbalster/a500kbd-usbhid-stm32/Src/main.c
  0, // 30 0
  0, // 31 1
  0, // 32 2
  0, // 33 3
  0, // 34 4
  0, // 35 5
  0, // 36 6
  0, // 37 7
  0, // 38 8
  0, // 39 9
  0, // 3A :
  0, // 3B ;
  0, // 3C <
  0, // 3D =
  0, // 3E >
  0, // 3F ?

  0, // 40 @
  0, // 41 A
  0, // 42 B
  0, // 43 C
  0, // 44 D
  0, // 45 E
  0, // 46 F
  0, // 47 G
  0, // 48 H
  0, // 49 I
  0, // 4A J
  0, // 4B K
  0, // 4C L
  0, // 4D M
  0, // 4E N
  0, // 4F O

  0, // 50 P
  0, // 51 Q
  0, // 52 R
  0, // 53 S
  0, // 54 T
  0, // 55 U
  0, // 56 V
  0, // 57 W
  0, // 58 X
  0, // 59 Y
  0, // 5A Z
  0, // 5B [
  0, // 5C 
  0, // 5D ]
  0, // 5E ^
  0, // 5F _

  0, // 60 apo
  HIDKEY_A, // 61 a
  HIDKEY_B, // 62 b
  HIDKEY_C, // 63 c
  HIDKEY_D, // 64 d
  HIDKEY_E, // 65 e
  HIDKEY_F, // 66 f
  HIDKEY_G, // 67 g
  HIDKEY_H, // 68 h
  HIDKEY_I, // 69 i
  HIDKEY_J, // 6A j
  HIDKEY_K, // 6B k
  HIDKEY_L, // 6C l
  HIDKEY_M, // 6D m
  HIDKEY_N, // 6E n
  HIDKEY_O, // 6F o

  HIDKEY_P, // 70 p
  HIDKEY_Q, // 71 q
  HIDKEY_R, // 72 r
  HIDKEY_S, // 73 s
  HIDKEY_T, // 74 t
  HIDKEY_U, // 75 u
  HIDKEY_V, // 76 v
  HIDKEY_W, // 77 w
  HIDKEY_X, // 78 x
  HIDKEY_Y, // 79 y
  HIDKEY_Z, // 7A z
  0, // 7B {
  0, // 7C |
  0, // 7D }
  0, // 7E ~
  0, // 7F DEL
};

uint8_t media_table[10] = {
  HIDKEY_MEDIA_SCAN_PREV,
  HIDKEY_MEDIA_STOP,
  HIDKEY_MEDIA_PAUSE,
  HIDKEY_MEDIA_SCAN_NEXT,
  HIDKEY_MEDIA_EJECT,
  0,
  0,
  HIDKEY_MEDIA_MUTE,
  HIDKEY_MEDIA_VOLUME_DOWN,
  HIDKEY_MEDIA_VOLUME_UP,
};

uint8_t fn_table[10] = {
  HIDKEY_F11,
  HIDKEY_F12,
  HIDKEY_F13,
  HIDKEY_F14,
  HIDKEY_F15,
  HIDKEY_F16,
  HIDKEY_F17,
  HIDKEY_F18,
  HIDKEY_F19,
  HIDKEY_F20,
};

struct mouseHID_t {
  uint8_t id;
  uint8_t buttons;
  int8_t x;
  int8_t y;
};
struct keyboardHID_t {
    uint8_t id;
    uint8_t modifiers;
    uint8_t key[6];
};

struct mediaHID_t {
  uint8_t id;
  uint8_t keys;
};

struct eeprom_config {
  char swap_ctrl_and_alt;
  char mouse_speed;
  char media_keys;
};
    
struct eeprom_config settings = {
  .swap_ctrl_and_alt = 0,
  .mouse_speed = 3,
  .media_keys = 1,
};

struct keyboardHID_t keyboardHID;
struct mediaHID_t mediaHID;
struct mouseHID_t mouseHID;

uint8_t buffer_data[8];
char help_mode = 0;
char mouse_mode = 0;
char powerup_mode = 0;
int elapsed_ms_counter = 0;
int n_pressed_keys = 0;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_TIM1_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_NVIC_Init(void);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

// activate DWT timer
void EnableTiming(void)
{
  CoreDebug->DEMCR &= ~CoreDebug_DEMCR_TRCENA_Msk;
  CoreDebug->DEMCR |=  CoreDebug_DEMCR_TRCENA_Msk;
  DWT->CTRL &= ~DWT_CTRL_CYCCNTENA_Msk;
  DWT->CTRL |=  DWT_CTRL_CYCCNTENA_Msk;
  DWT->CYCCNT = 0;
}

// microsecond version
uint32_t HAL_GetTicks_us()
{
  return DWT->CYCCNT / SYSTEM_US_TICKS;
}

// microsecond version
void HAL_Delay_us(uint32_t uSec)
{
  volatile uint32_t DWT_START = DWT->CYCCNT;
  if (uSec > (UINT_MAX / SYSTEM_US_TICKS))
  {
    uSec = (UINT_MAX / SYSTEM_US_TICKS);
  }

  volatile uint32_t DWT_TOTAL = (SYSTEM_US_TICKS * uSec);

  while((DWT->CYCCNT - DWT_START) < DWT_TOTAL);
}

void Print(const char *_buf )
{
  HAL_UART_Transmit(&huart1, (uint8_t *)_buf, strlen(_buf), 1000);
}

void Printf(const char *_fmt, ... )
{
  char buf[512];
  va_list ap;
  va_start(ap, _fmt);
  int len = vsprintf(buf, _fmt,ap);
  va_end(ap);
  HAL_UART_Transmit(&huart1, (uint8_t *)buf, len, 1000);
}

void Keyboard_Print(const uint8_t *s)
{
  struct keyboardHID_t khid;
  khid.id = 1;
  khid.modifiers = 0;
  khid.key[0] = 0;
  khid.key[1] = 0;
  khid.key[2] = 0;
  khid.key[3] = 0;
  khid.key[4] = 0;
  khid.key[5] = 0;
  
  for (;*s;++s)
  {
    //khid.modifiers = ascii2hid[*s].modifier;
    khid.key[0] = ascii2hid[*s];
    Printf("%c -> %02x \n\r",*s,ascii2hid[*s]);
    
    while (USBD_OK != USBD_HID_SendReport(&hUsbDeviceFS, (uint8_t *)&khid, sizeof(struct keyboardHID_t)))
    {
    }

    khid.modifiers = 0;
    khid.key[0] = 0;

    while (USBD_OK != USBD_HID_SendReport(&hUsbDeviceFS, (uint8_t *)&khid, sizeof(struct keyboardHID_t)))
    {
    }
  }
}

void SetMouseMode(char on)
{
  mouse_mode = on;
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, on ? GPIO_PIN_RESET : GPIO_PIN_SET);
}

void HardReset()
{
  GPIO_InitTypeDef GPIO_InitStruct;

  GPIO_InitStruct.Pin = RESET_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  HAL_GPIO_WritePin(GPIOA,RESET_Pin,GPIO_PIN_SET);
  HAL_Delay(200);
  HAL_GPIO_WritePin(GPIOA,RESET_Pin,GPIO_PIN_RESET);
  HAL_Delay(200);
  HAL_GPIO_WritePin(GPIOA,RESET_Pin,GPIO_PIN_SET);
  HAL_Delay(200);

  GPIO_InitStruct.Pin = RESET_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
}

void SoftReset()
{
  Printf("*** A500 USB HID Keyboard Firmware ***\n\r");

  keyboardHID.id = 1;
  keyboardHID.modifiers = 0;
  keyboardHID.key[0] = 0;
  keyboardHID.key[1] = 0;
  keyboardHID.key[2] = 0;
  keyboardHID.key[3] = 0;
  keyboardHID.key[4] = 0;
  keyboardHID.key[5] = 0;
  
  mediaHID.id = 2;
  mediaHID.keys = 0;

  mouseHID.buttons = 0;
  mouseHID.id = 3;
  mouseHID.x = 0;
  mouseHID.y = 0;
  
  n_pressed_keys=0;
  
  SetMouseMode(0);
  help_mode = 0;
  elapsed_ms_counter = 0;

  buffer_data[0] = 0;
  buffer_data[1] = 0;
  buffer_data[2] = 0;
  buffer_data[3] = 0;
  buffer_data[4] = 0;
  buffer_data[5] = 0;
  buffer_data[6] = 0;
  buffer_data[7] = 0;
}

int HandleKey(uint8_t key)
{
  switch(key)
  {
  case 0x78:
    Printf("reset warning\n\r");
    return 0;
  case 0xF9:
    Printf("last key code bad\n\r");
    return 0;
  case 0xFA:
    Printf("keyboard key buffer overflow\n\r");
    return 0;
  case 0xFC:
    Printf("keyboard self test fail\n\r");
    return 0;
  case 0xFD:
    Printf("initiate power-up key stream\n\r");
    powerup_mode = 1;
    return 0;
  case 0xFE:
    Printf("terminate power-up key stream\n\r");
    powerup_mode = 0;
    SoftReset();
    return 0;
  default:
    break;
  }
  uint8_t raw = key & 0x7f;
  int pressed = ((key & 0x80) >> 7) ^ 1;
  char touched=0;
  uint8_t code;

  if (powerup_mode)
  {
    Printf("%02x\n\r",raw);
    return 0;
  }
 
  code = amiga_to_hid[raw];
  
  if (mouse_mode)
  {
    if (code==HIDKEY_KP_MULTIPLY)
    {
      touched=1;
      SetMouseMode(0);
      mouseHID.buttons = 0;
      mouseHID.x = 0;
      mouseHID.y = 0;
      Printf("turning off mouse mode\n\r");
    }

    if (code==HIDKEY_KP_PLUS)
    {
      touched=1;
      if (pressed)
      {
        if (settings.mouse_speed<20) settings.mouse_speed++;
        Printf("mouse speed: %d\n\r",settings.mouse_speed);
      }
      return 0;
    }

