danielbalster/a500kbd-usbhid-stm32/Src/main.c
    if (code==HIDKEY_KP_MINUS)
    {
      if (pressed)
      {
        if (settings.mouse_speed>1) settings.mouse_speed--;
        Printf("mouse speed: %d\n\r",settings.mouse_speed);
      }
        return 0;
    }

    if (code==HIDKEY_DELETE)
    {
      touched=1;
      if (pressed)
        mouseHID.buttons |= 1;
      else
        mouseHID.buttons &=~ 1;
    }
    if (code==HIDKEY_HELP)
    {
      touched=1;
      if (pressed)
        mouseHID.buttons |= 2;
      else
        mouseHID.buttons &=~ 2;
    }
    if (code==HIDKEY_UP)
    {
      touched=1;
      mouseHID.y = pressed ? -settings.mouse_speed : 0;
    }
    if (code==HIDKEY_DOWN)
    {
      touched=1;
      mouseHID.y = pressed ? +settings.mouse_speed : 0;
    }
    if (code==HIDKEY_LEFT)
    {
      touched=1;
      mouseHID.x = pressed ? -settings.mouse_speed : 0;
    }
    if (code==HIDKEY_RIGHT)
    {
      touched=1;
      mouseHID.x = pressed ? +settings.mouse_speed : 0;
    }
    
    if (touched)
    {
      while (USBD_OK != USBD_HID_SendReport(&hUsbDeviceFS, (uint8_t *)&mouseHID, sizeof(mouseHID)))
      {
      }
      touched = 0;

      return 0;
    }
  }
  else
  {
    if (raw == 0x5f) // HELP
    {
      if (pressed)
      {
        help_mode = 1;
      }
      else
      {
        help_mode = 0;
      }
    }
  }
  
  if (help_mode)
  {
    switch (code)
    {
    case HIDKEY_MODIFIER_LEFT_CTRL:
      if (pressed)
      {
        Printf("swap_ctrl_and_alt = 0\n\r");
        settings.swap_ctrl_and_alt = 0;
      }
      return 0;
      
    case HIDKEY_MODIFIER_LEFT_ALT:
      if (pressed)
      {
        Printf("swap_ctrl_and_alt = 1\n\r");
        settings.swap_ctrl_and_alt = 1;
      }
      return 0;

    case HIDKEY_M:
      Printf("turning on mouse mode\n\r");
      SetMouseMode(1);
      help_mode = 0;
      elapsed_ms_counter = HAL_GetTick();
      return 0;

    case HIDKEY_R:
      Printf("hardreset\n\r");
      HardReset();
      help_mode = 0;
      return 0;
      
    case HIDKEY_DELETE:
      settings.media_keys ^= 1;
      if (settings.media_keys)
        Printf("function keys are media keys\n\r");
      else
        Printf("extended function keys\n\r");
      help_mode = 0;
      return 0;

    case HIDKEY_F1:
    case HIDKEY_F2:
    case HIDKEY_F3:
    case HIDKEY_F4:
    case HIDKEY_F5:
    case HIDKEY_F6:
    case HIDKEY_F7:
    case HIDKEY_F8:
    case HIDKEY_F9:
    case HIDKEY_F10:
      {
        int n = code - HIDKEY_F1;
        if (settings.media_keys)
        {
          if (pressed)
          {
            mediaHID.keys |= media_table[n];
          }
          else
          {
            mediaHID.keys &=~ media_table[n];
          }
          while (USBD_OK != USBD_HID_SendReport(&hUsbDeviceFS, (uint8_t *)&mediaHID, sizeof(mediaHID)))
          {
          }
          return 0;

        }
        else
        {
          code = fn_table[n];
        }
      }
      break;
      
    default:
      return 0;
    }
    
  }
  
  if (code==0) return 0;

  // is modifier?
  if (raw>=0x60 && raw<0x68)
  {
    if (settings.swap_ctrl_and_alt)
    {
      switch(code)
      {
      case HIDKEY_MODIFIER_LEFT_CTRL:
        code = HIDKEY_MODIFIER_LEFT_ALT;
        break;
      case HIDKEY_MODIFIER_LEFT_ALT:
        code = HIDKEY_MODIFIER_LEFT_CTRL;
        break;
      case HIDKEY_MODIFIER_RIGHT_ALT:
        code = HIDKEY_MODIFIER_RIGHT_CTRL;
        break;
      case HIDKEY_MODIFIER_RIGHT_UI:
        code = HIDKEY_MODIFIER_RIGHT_ALT;
        break;
      default:
        break;
      }
    }
        
    if (pressed)
    {
      keyboardHID.modifiers |= code;
    }
    else
    {
      keyboardHID.modifiers &=~ code;
    }
  }
  else
  {
    if (pressed)
    {
      int found=0;
      for (int i=0; i<n_pressed_keys; ++i)
      {
        if (keyboardHID.key[i] == code)
        {
          found=1;
          break;
        }
      }
      if (!found)
      {
        if (n_pressed_keys<6)
        {
          keyboardHID.key[n_pressed_keys]=code;
          n_pressed_keys++;
        }
      }
    }
    else
    {
      for (int i=0; i<n_pressed_keys; ++i)
      {
        if (keyboardHID.key[i] != code) continue;
        n_pressed_keys--;
        if (n_pressed_keys>0 && i!=n_pressed_keys)
        {
          keyboardHID.key[i] = keyboardHID.key[n_pressed_keys];
        }
        keyboardHID.key[n_pressed_keys]=0;
        break;
      }
    }
  }
  return 1;
}

// called by EXTI0_IRQHandler
//
// see Appendix G, Keyboard Interface in Amiga Hardware Reference Manual
//
void clock_irq_handler()
{
  static uint8_t val=0;
  static uint8_t clocks=0;
  
  // (1) collect bits, convert to logical LOW and HIGH
  val <<= 1;
  val |= (HAL_GPIO_ReadPin(GPIOA,DATA_Pin)^1);
  ++clocks;
  if (clocks==8)
  {
      // last bit was KEY PRESSED bit, reorder
      uint8_t key=(val>>1) | (val<<7);
      val = 0;
      clocks=0;
      
      // I'm collecting up to 8 keypresses in case mainloop is blocked/busy in a simple array
      if (buffer_data[7]<7)
      {
        buffer_data[buffer_data[7]]=key;
        buffer_data[7]++;
      }
      
      // finally, handshake back to the keyboard as described
      GPIO_InitTypeDef GPIO_InitStruct;
      GPIO_InitStruct.Pin = DATA_Pin;
      GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
      GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
      HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
      
      HAL_GPIO_WritePin(GPIOA,DATA_Pin,GPIO_PIN_RESET);
      HAL_Delay_us(85);
      GPIO_InitStruct.Pin = DATA_Pin;
      GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
      GPIO_InitStruct.Pull = GPIO_NOPULL;
      HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
  }
}

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */
   
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_TIM1_Init();
  MX_USB_DEVICE_Init();
  MX_USART1_UART_Init();

  /* Initialize interrupts */
  MX_NVIC_Init();

  /* USER CODE BEGIN 2 */

  EnableTiming();

  // reset amiga keyboard
  HardReset();
  
  uint8_t keys[8];
  uint64_t *pkeys = (uint64_t*)keys;
  uint64_t *pbuff = (uint64_t*)buffer_data;
  *pkeys = 0;
  *pbuff = 0;
  
